//
//  StringDefine.h
//  UThing
//
//  Created by luyuda on 14/11/20.
//  Copyright (c) 2014年 UThing. All rights reserved.
//

#ifndef UThing_StringDefine_h
#define UThing_StringDefine_h


#define SHARECONTENT @"自在旅行，记忆游心。旅行路上有了“游心旅行“这个APP神器，还有什么问题是解决不了的呢？http://www.uthing.cn"
#define PRODUCTCONTENT @"刚刚在游心网发现了一款不错的旅行产品《%@》，为游心网的旅行产品点个赞！"


#define USERLISTEN @"游心服务条款的确认\nUthing.cn的所有权与运作权归宁波游心信息科技发展有限公司 (以下简称\"游心\") 所有。本服务条款具有法律约束力。一旦您点选\" 注册\"并通过注册程序，即表示您自愿接受本协议之所有条款，并已成为游心的注册会员。用户在享用游心网络会员服务的同时，同 意接受游心网络会员服务提供的各类信息服务。\n服务内容\n1. 游心服务的具体内容由游心根据实际情况提供，游心对其所提供之服务拥有最终解释权。\n2. 游心在uthing.cn上向其会员提供包括在线酒店及旅游项目预订在内的相关网络服务。与相关网络服务有关的设备（如个人电脑、 手机、及其他与接入互 联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的 手机费）均由会员自行负担。\n会员权责\n1. 会员有权按照游心规定的程序和要求使用游心向会员提供的各项网络服务，如果会员对该服务有异议，可以与游心联系以便得到及 时解决。\n2. 用户在申请使用游心网络服务时，必须向游心提供准确的个人资料，如 个人资料有任何变动，必须及时更新。\n3. 会员须同意接受游心通过电子邮件或其他方式向会员发送促销或其他相关商业信息。\n4. 会员在游心的网页上发布信息或者利用游心的服务时必须符合国家的法律法规以及国际法的有关规定。\n5. 对于会员通过游心网上消息平台（包括但不限于论坛、BBS、评论）上传到游心网站上可公开获取区域的任何内容，会员同意授予 游心在全世界范围内享有 完全的、免费的、永久性的、不可撤销的、非独家的权利，以及再许可第三方的权利，以使用、复制、修改、 改编、出版、翻译、据以创作衍生作品、传播、表演和 展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的 其他任何形式的作品、媒体或技术中。"

#define IOS_7 ([[UIDevice currentDevice].systemVersion floatValue] >= 7.0)


#endif
